deividAlfa/stm32_soldering_iron_controller/BOARDS/Quicko/STM32F072C8/STM32SolderingStation.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F0
Dma.MEMTOMEM.2.PeriphInc=DMA_PINC_DISABLE
ProjectManager.MainLocation=Core/Src
RCC.MCOFreq_Value=48000000
PB13.GPIOParameters=GPIO_Label
RCC.USART1Freq_Value=48000000
TIM15.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
TIM17.Prescaler=479
VP_TIM17_VS_ClockSourceINT.Mode=Enable_Timer
Dma.MEMTOMEM.2.MemDataAlignment=DMA_MDATAALIGN_WORD
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F072C8Tx
Dma.ADC.0.Mode=DMA_CIRCULAR
SPI2.VirtualType=VM_MASTER
RCC.PLLCLKFreq_Value=48000000
VP_IWDG_VS_IWDG.Mode=IWDG_Activate
PA12.GPIOParameters=GPIO_Label
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_ADC_Init-ADC-false-HAL-true,5-MX_SPI2_Init-SPI2-false-HAL-true,6-MX_TIM17_Init-TIM17-false-HAL-true,7-MX_TIM15_Init-TIM15-false-HAL-true,8-MX_IWDG_Init-IWDG-false-HAL-true,9-MX_CRC_Init-CRC-false-HAL-true,10-MX_TIM2_Init-TIM2-false-HAL-true
PA9.GPIOParameters=GPIO_Label
Dma.SPI2_TX.1.PeriphInc=DMA_PINC_DISABLE
PA11.GPIOParameters=GPIO_Label
CRC.InputDataFormat=CRC_INPUTDATA_FORMAT_WORDS
Dma.ADC.0.Priority=DMA_PRIORITY_HIGH
PA3.GPIOParameters=GPIO_Label
RCC.USART2Freq_Value=48000000
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC13.GPIO_Label=OLED CS
PB13.GPIO_Label=OLED SCL
PB11.Signal=GPIO_Output
PB13.Signal=SPI2_SCK
PB15.Signal=SPI2_MOSI
PA2.GPIOParameters=GPIO_Label
PinOutPanel.RotationAngle=0
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_HSI48
ProjectManager.StackSize=0x10
Dma.SPI2_TX.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
Mcu.IP4=NVIC
Mcu.IP5=RCC
RCC.FCLKCortexFreq_Value=48000000
Mcu.IP2=DMA
Mcu.IP3=IWDG
TIM17.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
Mcu.IP0=ADC
PA12.Locked=true
Mcu.IP1=CRC
PA12.Signal=GPIO_Output
Mcu.UserConstants=
TIM15.Prescaler=479
Mcu.ThirdPartyNb=0
Dma.ADC.0.PeriphInc=DMA_PINC_DISABLE
NVIC.TIM17_IRQn=true\:2\:0\:true\:false\:true\:true\:true
RCC.HCLKFreq_Value=48000000
Mcu.IPNb=11
ProjectManager.PreviousToolchain=
Dma.MEMTOMEM.2.PeriphDataAlignment=DMA_PDATAALIGN_WORD
PA8.GPIOParameters=GPIO_Label
Mcu.Pin6=PB12
Mcu.Pin7=PB13
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
TIM17.IPParameters=Prescaler,Period,AutoReloadPreload,Channel,Pulse
Mcu.Pin8=PB15
Mcu.Pin9=PA8
RCC.AHBFreq_Value=48000000
SPI2.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_4
PB13.Locked=true
Mcu.Pin0=PC13
Mcu.Pin1=PA1
Dma.ADC.0.Direction=DMA_PERIPH_TO_MEMORY
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PA2
Mcu.Pin3=PA3
Mcu.Pin4=PA5
ADC.SamplingTime=ADC_SAMPLETIME_13CYCLES_5
Mcu.Pin5=PB11
ProjectManager.ProjectBuild=false
Dma.MEMTOMEM.2.MemInc=DMA_MINC_ENABLE
PA8.Locked=true
TIM17.Channel=TIM_CHANNEL_1
Mcu.IP10=TIM17
NVIC.SysTick_IRQn=true\:0\:0\:true\:false\:true\:false\:true
RCC.PLLMUL=RCC_PLL_MUL6
TIM15.Period=1999
PB12.GPIO_Label=OLED RST
Dma.MEMTOMEM.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
TIM17.Period=19999
ProjectManager.FirmwarePackage=STM32Cube FW_F0 V1.11.2
MxDb.Version=DB.6.0.21
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
Dma.MEMTOMEM.2.Mode=DMA_NORMAL
PA14.Mode=Serial_Wire
File.Version=6
PA10.GPIO_Label=WAKE
SPI2.CalculateBaudRate=12.0 MBits/s
PB7.Signal=TIM17_CH1N
VP_TIM15_VS_OPM.Mode=OPM_bit
PA8.Signal=GPIO_Input
Dma.MEMTOMEM.2.Direction=DMA_MEMORY_TO_MEMORY
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
VP_TIM15_VS_ClockSourceINT.Signal=TIM15_VS_ClockSourceINT
Dma.RequestsNb=3
ProjectManager.HalAssertFull=false
ProjectManager.ProjectName=STM32SolderingStation
Dma.ADC.0.MemInc=DMA_MINC_ENABLE
RCC.PLLMCOFreq_Value=48000000
PB7.GPIO_Label=PWM
Mcu.Package=LQFP48
Dma.SPI2_TX.1.Mode=DMA_NORMAL
PA5.Locked=true
SPI2.Mode=SPI_MODE_MASTER
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=NTC
Dma.ADC.0.Instance=DMA1_Channel1
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
IWDG.Reload=1249
PA10.Signal=GPIO_Input
PA5.GPIOParameters=GPIO_Label
Dma.SPI2_TX.1.Instance=DMA1_Channel5
Dma.ADC.0.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
Dma.Request2=MEMTOMEM
RCC.CECFreq_Value=32786.88524590164
Dma.Request1=SPI2_TX
RCC.APB1TimFreq_Value=48000000
SPI2.Direction=SPI_DIRECTION_2LINES
PB13.Mode=TX_Only_Simplex_Unidirect_Master
Dma.Request0=ADC
NVIC.TIM15_IRQn=true\:2\:0\:true\:false\:true\:true\:true
ADC.ExternalTrigConv=ADC_SOFTWARE_START
ProjectManager.CustomerFirmwarePackage=
PA3.Signal=ADC_IN3
PA5.Mode=IN5
PA2.Locked=true
RCC.I2SFreq_Value=48000000
Dma.SPI2_TX.1.MemInc=DMA_MINC_ENABLE
ProjectManager.ProjectFileName=STM32SolderingStation.ioc
Mcu.PinsNb=24
TIM17.Pulse=1
ProjectManager.NoMain=false
PC13.Locked=true
PC13.Signal=GPIO_Output
PA9.GPIO_Label=ROT ENC L
Dma.MEMTOMEM.2.Instance=DMA1_Channel2
SPI2.NSSPMode=SPI_NSS_PULSE_DISABLE
PB11.GPIO_Label=OLED DC
PA11.GPIO_Label=ROT ENC BUTTON
ProjectManager.DefaultFWLocation=true
ADC.IPParameters=ContinuousConvMode,SamplingTime,DMAContinuousRequests,EOCSelection,ExternalTrigConv
PB12.Locked=true
ProjectManager.DeletePrevious=true
VP_TIM17_VS_ClockSourceINT.Signal=TIM17_VS_ClockSourceINT
PA12.GPIO_Label=BUZZER
RCC.FamilyName=M
CRC.IPParameters=InputDataFormat
Dma.ADC.0.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
Dma.MEMTOMEM.2.Priority=DMA_PRIORITY_LOW
PA13.Signal=SYS_SWDIO
PA3.Mode=IN3
PA11.Locked=true
PA8.GPIO_Label=ROT ENC R
ProjectManager.TargetToolchain=STM32CubeIDE
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
PB7.GPIOParameters=GPIO_Label
PA9.Signal=GPIO_Input
PB11.GPIOParameters=GPIO_Label
SPI2.IPParameters=VirtualType,Mode,Direction,BaudRatePrescaler,CalculateBaudRate,DataSize,NSSPMode
ProjectManager.RegisterCallBack=
TIM15.IPParameters=TIM_MasterOutputTrigger,Prescaler,Period,AutoReloadPreload
PA1.Signal=ADC_IN1
PA5.Signal=ADC_IN5
ADC.DMAContinuousRequests=ENABLE
board=custom
Dma.SPI2_TX.1.Direction=DMA_MEMORY_TO_PERIPH
ProjectManager.LastFirmware=true
PB15.Mode=TX_Only_Simplex_Unidirect_Master
VP_TIM15_VS_OPM.Signal=TIM15_VS_OPM
RCC.VCOOutput2Freq_Value=8000000
Dma.ADC.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
PA1.Mode=IN1
Dma.SPI2_TX.1.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
MxCube.Version=6.2.1
NVIC.DMA1_Channel4_5_6_7_IRQn=true\:1\:0\:true\:false\:true\:false\:true
VP_TIM2_VS_ClockSourceINT.Mode=Internal
PB15.GPIO_Label=OLED SDA
PC13.GPIOParameters=GPIO_Label
Dma.SPI2_TX.1.Priority=DMA_PRIORITY_LOW
PA1.GPIO_Label=VREF
PA10.GPIOParameters=GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
PA9.Locked=true
ADC.EOCSelection=ADC_EOC_SEQ_CONV
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB15.GPIOParameters=GPIO_Label
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,CECFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSICECFreq_Value,I2SFreq_Value,MCOFreq_Value,PLLCLKFreq_Value,PLLMCOFreq_Value,PLLMUL,SYSCLKFreq_VALUE,SYSCLKSource,TimSysFreq_Value,USART1Freq_Value,USART2Freq_Value,VCOOutput2Freq_Value
IWDG.IPParameters=Reload,Prescaler
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F072C(8-B)Tx
PA2.Signal=ADC_IN2
ProjectManager.UnderRoot=true
Mcu.IP8=TIM2
RCC.HSICECFreq_Value=32786.88524590164
Mcu.IP9=TIM15
Mcu.IP6=SPI2
Mcu.IP7=SYS
ProjectManager.CoupleFile=false
RCC.SYSCLKFreq_VALUE=48000000
Mcu.Pin22=VP_TIM15_VS_OPM
Mcu.Pin23=VP_TIM17_VS_ClockSourceINT
RCC.TimSysFreq_Value=48000000
Mcu.Pin20=VP_TIM2_VS_ClockSourceINT
PA1.Locked=true
PA3.Locked=true
Mcu.Pin21=VP_TIM15_VS_ClockSourceINT
PA5.GPIO_Label=IRON TEMP
PA10.Locked=true
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
ProjectManager.CompilerOptimize=6
PB7.Mode=PWM Generation1 CH1N
PA11.Signal=GPIO_Input
VP_TIM15_VS_ClockSourceINT.Mode=Internal
VP_IWDG_VS_IWDG.Signal=IWDG_VS_IWDG
PA14.Signal=SYS_SWCLK
ProjectManager.HeapSize=0x10
Mcu.Pin15=PA14
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PB7
Mcu.Pin13=PA12
Mcu.Pin14=PA13
Mcu.Pin19=VP_SYS_VS_Systick
ProjectManager.ComputerToolchain=false
Mcu.Pin17=VP_CRC_VS_CRC
Mcu.Pin18=VP_IWDG_VS_IWDG
Mcu.Pin11=PA10
Mcu.Pin12=PA11
Mcu.Pin10=PA9
IWDG.Prescaler=IWDG_PRESCALER_32
PB7.Locked=true
PA2.Mode=IN2
SPI2.DataSize=SPI_DATASIZE_8BIT
NVIC.DMA1_Channel1_IRQn=true\:1\:0\:true\:false\:true\:false\:true
RCC.APB1Freq_Value=48000000
VP_CRC_VS_CRC.Mode=CRC_Activate
TIM15.TIM_MasterOutputTrigger=TIM_TRGO_RESET
ADC.ContinuousConvMode=ENABLE
Dma.SPI2_TX.1.MemDataAlignment=DMA_MDATAALIGN_BYTE
PB11.Locked=true
ProjectManager.DeviceId=STM32F072C8Tx
PB12.GPIOParameters=GPIO_Label
PB12.Signal=GPIO_Output
ProjectManager.LibraryCopy=1
PA3.GPIO_Label=V INPUT
isbadioc=false
